
export const validEmailRegex = RegExp(
  /^(([^<>()\[\]\.,;:\s@\"]+(\.[^<>()\[\]\.,;:\s@\"]+)*)|(\".+\"))@(([^<>()[\]\.,;:\s@\"]+\.)+[^<>()[\]\.,;:\s@\"]{2,})$/i
);

export const validUsernameRegex = RegExp(
  /^[_.@A-Za-z0-9-ŠšĐđČčĆćŽžџЏШшЂђЧчЋћЖжЉљЊњаАбБвВјЈгГдДеЕёЁжЖзЗиИйЙкКлЛмМнНоОпПрРсСтТуУѕЅфФхХџЏцЦчЧшШщЩъЪыЫьЬэЭюЮяЯЉљЊњХх]*$/
);
export const validNameRegex = RegExp(
  /^[.A-Za-z-ŠšĐđČčĆćŽžШшЂђџЏЧчЋћЖжаАбБвВгГдДеЕёЁжЖзЗјЈиИйЙкКлЛмМнНоОпПрРсСтТуУфФхХцЦчЧѕЅшШщЩџЏъЪыЫьЬэЭюЮяЯЉљЊњХх ]*$/
);
export const validNameRegex2 = RegExp(
  /^[A-Za-zŠšĐđČčĆćŽžШшЂђџЏЧчЋћЖжаАбБвВгГдДеЕёЁжЖзЗјЈиИйЙкКлЛмМнНоОпПрРсСтТуУфФхХцЦчЧѕЅшШщЩџЏъЪыЫьЬэЭюЮяЯЉљЊњХх ]*$/
);
export const validNumberRegex = RegExp(/^[0-9]*$/);

export const validLettersNumber = RegExp(
  /^[0-9a-zA-ZŽžĐđŠšĆćČčЉљЊњЕеРрТтЗзУуИиОоПпШшЂђЖжАаСсДдФфГгХхЈјКкЛлЧчЋћЅѕЏџЦцВвБбНнМм]*$/
);

export const validNameAndNumberRegex = RegExp(
  /^[.A-Za-z0-9-_ŠšĐđČčĆćŽžШшџЏЂђЧчЋћЖжЉљЊњаАбБвВгГдДејЈЕёЁжЖзЗиИйЙкКлЛмМнНоОпПрРсСтТуУфФхХцЦџЏчЧѕЅшШщЩъЪыЫьЬэЭюЮяЯЉљЊњХх ]*$/
);
